{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attr": {
        "kernel": "(16, 16)", 
        "num_filter": "200", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attr": {
        "kernel": "(16, 16)", 
        "num_filter": "200", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(16, 16)", 
        "num_filter": "200", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attr": {
        "kernel": "(5, 5)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attr": {"num_hidden": "500"}, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected3_weight", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected3_bias", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected3", 
      "attr": {"num_hidden": "2"}, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmaxoutput1_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmaxoutput1", 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 7, 8, 11, 12, 14], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16
  ], 
  "heads": [[15, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1001]}
}